# Brewfile
# Install everything: brew bundle --file=~/.dotfiles/Brewfile

# CLI Tools
brew "fnm"
brew "gh"
brew "git-lfs"
brew "spaceship"
brew "dockutil"
brew "duti"
brew "ripgrep"
brew "ffmpeg"
brew "yt-dlp"

# GUI Apps
cask "1password"
cask "ghostty"
cask "obsidian"
cask "spotify"
cask "google-chrome"
cask "raycast"
cask "slack"
cask "cleanshot"
cask "claude"
cask "dropbox"
cask "pixelsnap"
cask "superwhisper"
cask "ngrok"
